from itertools import *

#* numero 1

# graph = {'А': 'БВ', 'Б': 'АВ', 'В': 'АБЕГД', 'Г': 'ВЕК', 'Д': 'ВЕ', 'Е': 'ВГКД', 'К': 'ЕГ',}
# table = '-+-+---' + '+--+-+-' + '----++-' + '++---++' + '--+--+-' + '-++++-+' + '---+-+-'

#* numero 2

# graph = {'A': 'GD', 'B': 'DEF', 'C': 'GEF', 'D': 'AB', 'E': 'BFCG', 'F': 'BEC', 'G': 'AEC',}
# table = '---+--+' + '--+-+-+' + '-+--+++' + '+----+-' + '-++--+-' + '--+++--' + '+++----'

#* numero 3

# graph = {'А': 'ВГБ', 'Б': 'АГД', 'В': 'АЕ', 'Г': 'АБДЕ', 'Д': 'БГК', 'Е': 'ВГЛ', 'К': 'ДЛ', 'Л': 'КЕ'}
# table = '-+-+---+' + '+-+-----' + '-+---+-+' + '+-----+-' + '-----+++' + '--+-+--+' + '---++---' + '+-+-++--'

#* numero 4

# graph = {'А': 'ВКБ', 'Б': 'АД', 'В': 'ЖАГ', 'Г': 'ЕДВ', 'Д': 'ЕГБ', 'Е': 'ГД', 'Ж': 'КВ', "К": 'АЖ'}
# table = '----+--+' + '--+-+-+-' + '-+--+---' + '-----++-' + '+++-----' + '---+---+' + '-+-+---+' + '+----++-'

#* numero 5

# graph = {'A': 'BF', 'B': 'DFA', 'C': 'DGE', 'D': 'BC', 'E': 'CG', 'F': 'GBA', 'G': 'FCE'}
# table = '----++-' + '--++--+' + '-+--+-+' + '-+---+-' + '+-+--+-' + '+--++--' + '-++----'

#* numero 6

# graph = {'А': 'БГВ', 'Б': 'АГД', 'В': 'АЕ', 'Г': 'ЕАБД', 'Д': 'БГК', 'Е': 'ВГК', 'К': 'ЛЕД', 'Л': 'К'}
# table = '-+---+++' + '+-++----' + '-+---+--' + '-+--+--+' + '---+----' + '+-+---+-' + '+----+-+' + '+--+--+-'

#* numero 7

graph = {'А': 'БГВ', 'Б': 'АГД', 'В': 'АЕ', 'Г': 'ЕАБД', 'Д': 'БГК', 'Е': 'ВГК', 'К': 'ЛЕД', 'Л': 'К'}
table = '-+---+++' + '+-++----' + '-+---+--' + '-+--+--+' + '---+----' + '+-+---+-' + '+----+-+' + '+--+--+-'

for item in permutations(graph):
  answer = ''
  for x in item:
    for y in item:
      if y in graph[x]:
        answer += "+"
      else:
        answer += "-"
  if answer == table: print(item)